/*
残しておいていただきたい2021年度の受講生(7名分)				
	1922001	アサダ　サラ		
	1922029	コウノ　アリサ		
	19N2048	タナカ　ヤヨイ		
	2022021	カワモト　アヤミ		
	2022027	コテラ　アヤカ		
	2022059	タケナカ　ケイコ		
	2022071	ヨコタ　ルイ		
*/
var data2021 = [
  {
    id: 4,
    trainer: '1922001',
    rule: '[{},{"msg":"どうしてシンデレラは信心深く善良なままでいられたと思いますか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"継娘とはなんでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"どうして鳥がシンデレラの望みを叶えることができたと思いますか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{"msg":"どうしてハトやキジバト、小鳥がシンデレラの言葉を理解することができたのですか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"2人の姉と継母はシンデレラと外国の王女様は同一人物なのにどうして別人だと思ったのでょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"はしばみの木とはなんですか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"可愛い足とはどういう意味ですか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"どうして親指を切り落としたのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{},{"msg":"どうして2人は意地悪と不誠実を行わなければならなかったと思いますか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""}]'
  },
  {
    id: 7,
    trainer: '1922029',
    rule: '[{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"”二人は考えられるかぎりの意地悪をした”とありますが、その意地悪とは何でしょうか？ ","qap":[{"q":"エンドウ豆やレンズ豆をま","a":"また座って豆を拾わなければいけないのは、辛いですね。"},{"q":"嘲","a":"そうですね。では、二人はどんな思いでシンデレラを嘲たのでしょうか。１度考えてみましょう。"},{"q":"","a":""}],"nca":"そうですね。二人はシンデレラにいろんな意地悪をしています。シンデレラはとても辛いでしょうね。"},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"継母はなぜシンデレラも舞踏会へ連れて行かないのでしょうか？","qap":[{"q":"家事をやってもら","a":"なるほど。自分たちが家事をやりたくないから、シンデレラにかわりにさせようと思って行かせないようにしているのかもしれないですね。"},{"q":"","a":""},{"q":"","a":""}],"nca":"なるほど。自分たちが恥ずかしい思いをしたくないから連れて行かないのかもしれませんね。"},{"msg":"私たちがよく知っている『シンデレラ』のお話では、誰がシンデレラの来ていた服や靴をドレスやガラスの靴にしましたか？ ","qap":[{"q":"魔法使","a":"そうでしたね。"},{"q":"","a":""},{"q":"","a":""}],"nca":"そうでしたね。ちなみに、その魔法使いはドレスや靴以外にも魔法で何かを作り上げました。それは何か、知っていますか？ 思い出してみてください。"},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"私たちがよく知っている『シンデレラ』のお話では、夜の12時に魔法がとけてしまうため、12時の鐘がなり始めてから急いで帰っていましたが、このお話では夕方に帰っています。この部分以外にも、知っている『シンデレラ』のお話と異なっている部分が沢山ありますね。","qap":[{"q":"知らな","a":" そうなんですね。一度読んでみて比較してみると、面白いと思いますよ。"},{"q":"","a":""},{"q":"","a":""}],"nca":"どういう部分が異なっているのか、確認しながら読んでみると面白いかもしれません。けっこう異なっているところがあるので、比較しながら読んでみると面白いと思いますよ。"},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"Q貴方なら自分のかかとや足の指を切り落としてまで、靴を履こうとしますか？ ","qap":[{"q":"履こうとす","a":"なるほど。貴方は痛みを我慢して履こうとするのですね。 それは、娘たちのように花嫁になりたいからですか？それとも別の理由がありますか？"},{"q":"履きま","a":"なるほど。貴方は履くのですね。"},{"q":"","a":""}],"nca":"なるほど。それはなぜですか？理由があれば教えてください。"},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""}]'
  },
  {
    id: 10,
    trainer: '19N2048',
    rule: '[{},{"msg":"「金持ちの妻」とは誰のことですか？ 正解の場合→そうだね。お母さんだね。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"「高慢な王女さま」とは誰のことですか？ 正解の場合→そうそう！シンデレラだね！二人はとっても意地悪だね。ところで、二人って誰のこと？ 二人に意地悪されたら、あなたはどうする？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"涙が落ちた「その枝」はなんていう木の枝？シンデレラはどんな女の子だと思った？ お母さんが死んでしまう前に言ってたことをちゃんと守ってるね。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{},{},{},{"msg":"どうして鳩小屋を壊したのかな？王子様の気持ちになって、想像してみよう！","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"どうしてシンデレラは王子様から逃げたのかな？あなたがシンデレラだったらどうする？？A1.そうかもしれないね。 A2.それはすごいね！","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{"msg":"この後、とっても怖い様子が書かれているから、怖くなったら読むのをやめていいよ。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"継母は怖いね。どうしてお妃様になったら歩かなくていいんだろう。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{"msg":"この後、とっても怖い様子が書かれているよ！途中で読むのをやめてもいいよ。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"これはグリム童話っていうバージョンのシンデレラだったけど、どうだったかな？怖かった？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""}]'
  },
  {
    id: 17,
    trainer: '2022021',
    rule: '[{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"女中という言葉の意味は分かる？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":"召使いという意味だよ"},{"msg":"なぜシンデレラは枝を欲しがったのでしょうか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"継母はシンデレラが舞踏会へ行くのを許さなかったのでしょうか？ ","qap":[{"q":"可愛くな","a":"そうだね、シンデレラが可愛くないと感じて虐めていたのかも"},{"q":"仕事をしない","a":"いつもさせている家事をしないと困るから行かせなかったとも考えられるね"},{"q":"","a":""}],"nca":""},{"msg":"なぜ白い鳩やキジバト、小鳥達はシンデレラを手伝ってくれたのでしょう？ ","qap":[{"q":"可哀想","a":"確かに、可哀想なシンデレラを助けてあげたいという優しい心を持っていたかもしれないね"},{"q":"貰える","a":"なるほど！台所仕事をしているシンデレラを手伝えばお礼に餌とかを貰えるかもしれないね"},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ継母は心の中で「今度はきっとやれないわよ」と思ったのでしょう？ ","qap":[{"q":"無理","a":"シンデレラ一人では絶対に出来ないことだもんね"},{"q":"増やした","a":"同じ時間で2倍の数をこなすのは不可能だと思うよね"},{"q":"","a":""}],"nca":""},{"msg":"なぜ母親の墓へ行ったのでしょう？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"三人はなぜシンデレラだと気づかなかったのでしょうか？ ","qap":[{"q":"姿","a":"そうだね、いつも女中として働かされている姿とは見違えているものね"},{"q":"仕事をしている","a":"たしかに、シンデレラが仕事をしていると思い込んでいたかもしれないね"},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ王子はシンデレラ以外とは踊ろうとしなかったのでしょうか？ ","qap":[{"q":"綺麗","a":"王子も一番綺麗な人を手放したくなかったのかもね"},{"q":"惚れ","a":"シンデレラに惚れていたなら、一途な行動も理解できるね"},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ二羽の鳩は叫んだのでしょう？","qap":[{"q":"許せな","a":"鳩たちがシンデレラの味方なら、それを虐める姉のことは許せないよね"},{"q":"味方","a":"シンデレラの味方なら、姉がズルをしたことを伝えたのかもしれないね"},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ継母と娘たちは青ざめたのでしょう？ ","qap":[{"q":"嫉妬","a":"今まで虐めていたシンデレラが幸せになるのが許せなかったのかもしれないね"},{"q":"気づかな","a":"舞踏会でシンデレラがいるとは気づかなかったなら、なぜ靴のサイズが合うのか訳が分からないと思うかもね"},{"q":"","a":""}],"nca":""},{"msg":"なぜ姉たちはご機嫌とりをしたのでしょう？ ","qap":[{"q":"財産","a":"性格の悪い姉なら財産目的でシンデレラと仲良くなろうとしたのかもしれないね"},{"q":"","a":""},{"q":"","a":""}],"nca":""}]'
  },
  {
    id: 20,
    trainer: '2022027',
    rule: '[{},{"msg":"最期は、なぜ分かったの？","qap":[{"q":"病気で少しずつ母親がよわっていったから。","a":"そうだね。だんだんと動けなくなったかも。"},{"q":"病","a":"そうだね。"},{"q":"神","a":"信心深いからだね。"}],"nca":"そうだね。わかる時はわかるのだね。"},{"msg":"お姉さんは、どうしてこんなに意地悪なの？","qap":[{"q":"シンデレラが憎いから","a":"もとは、シンデレラがお金持ちだから、もとは貧乏だった姉たちはシンデレラが、憎いんだよ。"},{"q":"シンデレラが、綺麗な顔だから","a":"自分らより優れているシンデレラに嫉妬しているんだよ"},{"q":"","a":""}],"nca":""},{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{},{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 28,
    trainer: '2022059',
    rule:  '[{},{"msg":"この話は童話としても、ディズニーなどでも有名ですよね。 でも私、このお母さんの遺言の部分とかは知らなかったです。みなさんはどうでしたか？知っているシンデレラと同じでしたか？  最初の文章、いきなり「金持ちの妻が病気になり〜」となっているのですが、聞いていて自然なストーリーに聞こえましたか？","qap":[{"q":"私も知らなかったです","a":"なんか文章も不自然かもね"},{"q":"最初の始まり方こんなんだっけ？","a":""},{"q":"","a":""}],"nca":""},{"msg":"この男はシンデレラの父親なのですが、この文を読んだとき良い人だと思いましたか？ 正直私は、これだけでは彼の人物像がわからなかったです…。小学生への質問 「嘲る」の意味、なんとなくでもわかりますか？ 読者への質問 「灰かぶり」という言葉が「シンデレラ」と同じ意味だというのはみなさん知ってましたか？ 前の文章でもそうですが、シンデレラのお父さん、実の娘がいじめられているのに助けてないんです。酷いと思いませんか？ それに、灰の中に豆を投げたり、眠れる場所を灰のそばに置いたり、意地悪というのも少し変わっているものもあると思いませんか？","qap":[{"q":"灰かぶりは確かにひどいかも","a":"いたずらのレベルが微妙だね"},{"q":"お父さんこんな人だったのか、意外だな","a":""},{"q":"","a":""}],"nca":""},{"msg":"継娘には真珠や宝石、ドレスをプレゼントしたというのに、実の娘に、頼まれた枝だけしか与えなかったのはやっぱりひどいと思いませんか？せめてアクセサリーでもプレゼントしてあげればよかったと思うんですよね。  最後の文章、シンデレラが母親の墓に行って涙を流すシーンなのですが、どんなふうに読んで欲しいですか？単調なときと感情豊かに読むのとでは、感じ方は違いますか？この、シンデレラが小鳥に頼んだ望みって、一体なんだったのでしょうか。何を小鳥から受け取ったのでしょう。みなさんはなんだと思いますか？","qap":[{"q":"お父さんあんま良い人じゃないのね","a":"まあ読み方はそりゃ感情豊かな方が伝わるかな"},{"q":"えー、最後のはもう分かんない","a":""},{"q":"","a":""}],"nca":"たしかに、シンデレラの父親は、私が知っているシンデレラとは違って良い人ではないのはよく伝わりました。"},{"msg":"直接この話には関係ないのですが、招待されるのが若くて美しい女性限定というの、酷いと思いませんか？全ての女性に、平等に権利があった方がいい気もするのですが、みなさんはどう思いますか？","qap":[{"q":"ジェンダー問題ってこんな身近にあるんだ","a":"うーんたしかに。"},{"q":"私が読んだシンデレラだったらこう書いていた記憶ないです","a":""},{"q":"","a":""}],"nca":"私もそうおもいます。女性も美しい人限定って、差別ですよね"},{"msg":"私が知っているシンデレラのストーリーには、この話は無かったです。みなさんはこの場面があることをご存知でしたか？ また、「良い豆をかめに、悪い豆をみなさんに」という部分、どういう意味なのか分かりますか？もし分かる方がいれば教えてください。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"継母は、新たにシンデレラに条件を課したわけですが、先程の内容となにが変わったのか、少し分かりにくいと思いませんか？ この継母の台詞を単調に読んだ場合、嫌味っぽい読み方をした時と伝わり方は変わってくるでしょうか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"先程も述べたことではありますが、継母のお題に答えようとするシンデレラの返答も、やはり似ていますね。セリフも同じものが使われているところがあります。私は正直、もう少し違うセリフだったらと思いましたが、皆さんはどう思いましたか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"元々服がなく、踊れないと分かっているのなら、最初から条件など課さずにそう言えば良かったのにと思ってしまいました。皆さんはどうでしたか？  そういえば、このシンデレラには魔法使いの存在がいません。魔法使いではなく、小鳥に手伝ってもらい自分でドレスを作っています。このストーリーを読んで、魔法使いのいるストーリーの方がいいと思いましたか？ぜひ感想を教えてください。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"いきなり場面が変わってしまったのですが、一つ物語に疑問が出てきました。 この話では、継母たちはシンデレラが豆を拾っていると思っています。しかし前の話では、継母はシンデレラが豆を拾い終わっているのを知っているような口ぶりだったと思いませんか？皆さんの意見はどうでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"王子の宮殿は、シンデレラの家から近かったのでしょうか？それに実の娘が鳩小屋にいるというのに、どうしてツルハシなどで小屋を壊そうと考えたのでしょうか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜシンデレラは、パーティに来ていることにしなかったのでしょう。 また、魔法使いではなく木の金と銀がなる木が、ドレスを作っていたというストーリー、皆さんは聞いたことありますか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"この話で、シンデレラと王子の人柄をどう感じましたか？シンデレラは、私たちが知っているストーリーよりもこんなに情熱的だったでしょうか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"そして3日目も、それまでと同様踊り明かしたということがわかりますが、そうまでして王子と踊りたいのであれば、逃げることなく名前を告げるべきだと感じたのですがどうでしょうか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"我々が知っているラストスパートに入ったわけですが、物語の鍵であるガラスの靴は、シンデレラの不注意ではなく意図的に取られたものだと知りどう思いましたか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"このシーンは衝撃でしたね。自分の娘を王子と結婚させるために、指を切らせるとは私も思いませんでした。これは子供に読ませていいシーンではないですね。 そのようなシーンで少しリアルさを持ちつつ、鳥が喋るというファンタジー性もありますが、それでもやはり子供には読ませる本ではないと思いますか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"このシーンも、1人目の継娘と同じ展開ですね。足を切ってまで、なぜ継娘は母親に従うのか、私は疑問なのですが、なぜだと思いますか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"この話で、シンデレラの父親の人間性がはっきりと見えたように感じます。自分の実の娘を、台所女中と呼びました。この文から、シンデレラは、母親が亡くなってから味方が誰1人いなかったということも分かりますね。シンデレラは今までどのような気持ちで過ごしてきたのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"恐ろしくなり、怒りで青ざめたのが継母、継娘だと書かれてましたが、父親はどう思っていたのでしょうか。鳥たちがシンデレラのことをあの時の姫と証明してくれたのですが、鳥が喋るというのはこの世界ではありがちなことなのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"終わり方として、これほど印象的な童話は少ないです。私が知っているシンデレラは、この話の衝撃を緩和するために改変されたものだったのでしょうか。目を取り出すという小鳥たちのむごさに、驚きを隠せないという人は多いのではないでしょうか。皆さんはどうでしたか？","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""}]'
  },
  {
    id: 31,
    trainer: '2022071',
    rule: '[{},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜシンデレラは辛い仕事をさせられたのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜシンデレラは娘たちに意地悪をされたのでしょうか。なぜ白い鳥はシンデレラの望んだものをくれたのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜシンデレラは舞踏会に行きたかったのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ鳥たちはシンデレラを助けてくれたのでしょうか。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{"msg":"豆を集めたのに連れて行かないのはひどいですよね。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"鳥がドレスや靴を渡せるのは不思議ですね。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜ王子はシンデレラとだけ踊ったのでしょう。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{},{},{"msg":"シンデレラは逃げるのが上手ですね。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜシンデレラは何度も逃げたのでしょう。","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"なぜお后になったら歩かなくて良いのでしょうか","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"とても痛いことを娘にさせる母親はひどいですね。なぜ鳥たちは王子に血が付いていることを教えたのでしょうか","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"シンデレラを王子と合わせようとしない親はひどいですよね","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{"msg":"シンデレラが花嫁とわかってよかったですね","qap":[{"q":"","a":""},{"q":"","a":""},{"q":"","a":""}],"nca":""},{}]'
  }
];

/*
初期化していただきたい、2022年度登録者リスト（16名分）				
				
	1822038	岡﨑　寧々		
	1921121	小澤　菜々美		
	1922018	片岡　彩乃		
	2022003	藤井　英里奈		
	2022020	河邉　万葉		
	2022030	李　璧名		
	2022045	小野　凛子		
	2122019	宮坂　璃奈		
	2122022	グエン ティ ゴック アイン		
	2122030	齊藤　杏花		
	2122031	佐々木　麻帆		
	18N4059	上田　彩佳		
	19N2058	後田　純		
	21N2015	岩瀬　恵		
	21N2028	グエン ティ トゥ チャン		
	21N2045	徳山　永美子		
*/
var data2022 = [
  {
    id: 100,
    trainer: '1822038',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 101,
    trainer: '1921121',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 102,
    trainer: '1922018',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 103,
    trainer: '2022003',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 104,
    trainer: '2022020',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 105,
    trainer: '2022030',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 106,
    trainer: '2022045',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 107,
    trainer: '2122019',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 108,
    trainer: '2122022',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 109,
    trainer: '2122030',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 110,
    trainer: '2122031',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 111,
    trainer: '18N4059',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 112,
    trainer: '19N2058',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 113,
    trainer: '21N2015',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 114,
    trainer: '21N2028',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 115,
    trainer: '21N2045',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  }
];

/*			
予備として初期化していただきたいアカウント(10名分)				
	1622001			
	1622002			
	1622003			
	1622004			
	1622005			
	1622006			
	1622007			
	1622008			
	1622009			
	tyoshida			
*/
var guest = [
  {
    id: 40,
    trainer: 'tyoshida',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 41,
    trainer: '1622001',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 42,
    trainer: '1622002',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 43,
    trainer: '1622003',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 44,
    trainer: '1622004',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 45,
    trainer: '1622005',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 46,
    trainer: '1622006',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 47,
    trainer: '1622007',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 48,
    trainer: '1622008',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
  {
    id: 49,
    trainer: '1622009',
    rule: '[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]'
  },
];

/*
 *
 */

const fs = require("fs");
const sqlite3 = require("sqlite3").verbose();
var db;

// raw function

function run(sql, params) {
	return new Promise((resolve, reject) => {
		db.run(sql, params, (err) => {
			if (err) reject(err);
			resolve();
		});
	});
}

function run2(sql, param0, param1) {
	return new Promise((resolve, reject) => {
		db.run(sql, param0, param1, (err) => {
			if (err) reject(err);
			resolve();
		});
	});
}

function get(sql, params) {
	return new Promise((resolve, reject) => {
		db.get(sql, params, (err, row) => {
			if (err) reject(err);
			resolve(row);
		});
	});
}

function all(sql, params) {
	return new Promise((resolve, reject) => {
    if (params != null) {
      db.all(sql, params, (err, row) => {
        if (err) reject(err);
        resolve(row);
      });  
    } else {
      db.all(sql, (err, row) => {
        if (err) reject(err);
        resolve(row);
      });  
    }
	});
}

function each(sql, func) {
	return new Promise((resolve, reject) => {
		db.each(sql,
      (err, row) => {
        func(err, row);
      }, (err) => {
			  if (err) reject(err);
			  resolve();
		});
	});
}

/*
function main() {
  for (var i = 0; i < data2021.length; i++) {
    console.log(data2021[i]);
  }
  for (var i = 0; i < data2022.length; i++) {
    console.log(data2022[i]);
  }
  for (var i = 0; i < guest.length; i++) {
    console.log(guest[i]);
  }
}
*/


async function main()
{
  const name = 'train_data.db'
  db = new sqlite3.Database(name);

  await run(
    "CREATE TABLE Rules (id INTEGER PRIMARY KEY AUTOINCREMENT, trainer TEXT, rule TEXT)"
  );
/*
  for (var i = 0; i < kv.length; i++) {
    await run2(
      'INSERT INTO Rules (trainer,rule) VALUES (?,?)', kv[i].k, kv[i].v
    );
  }
*/
  for (var i = 0; i < data2021.length; i++) {
    //console.log(data2021[i].trainer+": "+data2021[i].rule);
    await run2(
      'INSERT INTO Rules (trainer,rule) VALUES (?,?)', 
      data2021[i].trainer, data2021[i].rule
    );
  }
  for (var i = 0; i < data2022.length; i++) {
    //console.log(data2022[i].trainer+": "+data2022[i].rule);
    await run2(
      'INSERT INTO Rules (trainer,rule) VALUES (?,?)', 
      data2022[i].trainer, data2022[i].rule
    );
  }
  for (var i = 0; i < guest.length; i++) {
    //console.log(guest[i].trainer+": "+guest[i].rule);
    await run2(
      'INSERT INTO Rules (trainer,rule) VALUES (?,?)', 
      guest[i].trainer, guest[i].rule
    );
  }
}

main();